#조건에 맞는 데이터만 추출하기 - filter() - 행 추출출

#------------------------------
## dplyr 패키지로드& 데이터 준비

library(dplyr)
exam <- read.csv("Data/csv_exam.csv")
exam
#    id class math english science
# 1   1     1   50      98      50
# 2   2     1   60      97      60
# 3   3     1   45      86      78
# 4   4     1   30      98      58
# 5   5     2   25      80      65
# 6   6     2   50      89      98
# 7   7     2   80      90      45
# 8   8     2   90      78      25
# 9   9     3   20      98      15
# 10 10     3   50      98      45
# 11 11     3   65      65      65
# 12 12     3   45      85      32
# 13 13     4   46      98      65
# 14 14     4   48      87      12
# 15 15     4   75      56      78
# 16 16     4   58      98      65
# 17 17     5   65      68      98
# 18 18     5   80      78      90
# 19 19     5   89      68      87
# 20 20     5   78      83      58


#------------------------------
# exam에서 class 가 1인 경우만 추출하여 출력
exam %>% filter(class == 1)
#### [참고] 단축키 [Ctrl+Shit+M]으로 %>% 기호 입력

#   id class math english science
# 1  1     1   50      98      50
# 2  2     1   60      97      60
# 3  3     1   45      86      78
# 4  4     1   30      98      58


# 2반인 경우만 추출
exam %>% filter(class == 2)

#   id class math english science
# 1  5     2   25      80      65
# 2  6     2   50      89      98
# 3  7     2   80      90      45
# 4  8     2   90      78      25


# 1반이 아닌 경우
exam %>% filter(class !=1)

#    id class math english science
# 1   5     2   25      80      65
# 2   6     2   50      89      98
# 3   7     2   80      90      45
# 4   8     2   90      78      25
# 5   9     3   20      98      15
# 6  10     3   50      98      45
# 7  11     3   65      65      65
# 8  12     3   45      85      32
# 9  13     4   46      98      65
# 10 14     4   48      87      12
# 11 15     4   75      56      78
# 12 16     4   58      98      65
# 13 17     5   65      68      98
# 14 18     5   80      78      90
# 15 19     5   89      68      87
# 16 20     5   78      83      58


# 3반이 아닌 경우
exam %>%  filter(class!=3)

#    id class math english science
# 1   1     1   50      98      50
# 2   2     1   60      97      60
# 3   3     1   45      86      78
# 4   4     1   30      98      58
# 5   5     2   25      80      65
# 6   6     2   50      89      98
# 7   7     2   80      90      45
# 8   8     2   90      78      25
# 9  13     4   46      98      65
# 10 14     4   48      87      12
# 11 15     4   75      56      78
# 12 16     4   58      98      65
# 13 17     5   65      68      98
# 14 18     5   80      78      90
# 15 19     5   89      68      87
# 16 20     5   78      83      58



#------------------------------
## 초과, 미만, 이상, 이하 조건 걸기

# 수학 점수가 50점을 초과한 경우
exam %>% filter(math > 50)

#    id class math english science
# 1   2     1   60      97      60
# 2   7     2   80      90      45
# 3   8     2   90      78      25
# 4  11     3   65      65      65
# 5  15     4   75      56      78
# 6  16     4   58      98      65
# 7  17     5   65      68      98
# 8  18     5   80      78      90
# 9  19     5   89      68      87
# 10 20     5   78      83      


# 수학 점수가 50점 미만인 경우
exam %>% filter(math < 50)

#   id class math english science
# 1  3     1   45      86      78
# 2  4     1   30      98      58
# 3  5     2   25      80      65
# 4  9     3   20      98      15
# 5 12     3   45      85      32
# 6 13     4   46      98      65
# 7 14     4   48      87      12


# 영어 점수가 80점 이상인 경우
exam %>%  filter(english>=80)

#    id class math english science
# 1   1     1   50      98      50
# 2   2     1   60      97      60
# 3   3     1   45      86      78
# 4   4     1   30      98      58
# 5   5     2   25      80      65
# 6   6     2   50      89      98
# 7   7     2   80      90      45
# 8   9     3   20      98      15
# 9  10     3   50      98      45
# 10 12     3   45      85      32
# 11 13     4   46      98      65
# 12 14     4   48      87      12
# 13 16     4   58      98      65
# 14 20     5   78      83      58


# 영어점수가 80점 이하인 경우
exam %>% filter(english <= 80)

#   id class math english science
# 1  5     2   25      80      65
# 2  8     2   90      78      25
# 3 11     3   65      65      65
# 4 15     4   75      56      78
# 5 17     5   65      68      98
# 6 18     5   80      78      90
# 7 19     5   89      68      87



#------------------------------
## 여러 조건을 충족하는 행 추출하기 :&

# 1반 이면서 수학 점수가 50점 이상인 경우
exam %>% filter(class == 1 & math >= 50)

#   id class math english science
# 1  1     1   50      98      50
# 2  2     1   60      97      60


# 2반 이면서 영어점수가 80점 이상인 경우
exam %>% filter(class == 2 & english >= 80)

#   id class math english science
# 1  5     2   25      80      65
# 2  6     2   50      89      98
# 3  7     2   80      90      45



#------------------------------
## 여러 조건 중 하나 이상 충족하는 행 추출하기: |

# 수학 점수가 90점 이상이거나 영어점수가 90점 이상인 경우
exam %>% filter(math >= 90 | english >= 90)

#   id class math english science
# 1  1     1   50      98      50
# 2  2     1   60      97      60
# 3  4     1   30      98      58
# 4  7     2   80      90      45
# 5  8     2   90      78      25
# 6  9     3   20      98      15
# 7 10     3   50      98      45
# 8 13     4   46      98      65
# 9 16     4   58      98      65


# 영어점수가 90점 미만이거나 과학점수가 50 점 미만인 경우
exam %>% filter(english < 90 | science < 50)

#   id class math english science
# 1   3     1   45      86      78
# 2   5     2   25      80      65
# 3   6     2   50      89      98
# 4   7     2   80      90      45
# 5   8     2   90      78      25
# 6   9     3   20      98      15
# 7  10     3   50      98      45
# 8  11     3   65      65      65
# 9  12     3   45      85      32
# 10 14     4   48      87      12
# 11 15     4   75      56      78
# 12 17     5   65      68      98
# 13 18     5   80      78      90
# 14 19     5   89      68      87
# 15 20     5   78      83      58



#------------------------------
## 목록에 해당되는 행 추출하기
exam %>% filter(class == 1 | class == 3 | class == 5) # 1, 3, 5 반에 해당되면 추출

#    id class math english science
# 1   1     1   50      98      50
# 2   2     1   60      97      60
# 3   3     1   45      86      78
# 4   4     1   30      98      58
# 5   9     3   20      98      15
# 6  10     3   50      98      45
# 7  11     3   65      65      65
# 8  12     3   45      85      32
# 9  17     5   65      68      98
# 10 18     5   80      78      90
# 11 19     5   89      68      87
# 12 20     5   78      83      58


# %in% 기호 이용하기
exam %>% filter(class %in% c(1,3,5)) # 1, 3, 5 반에 해당하면 추출

#    id class math english science
# 1   1     1   50      98      50
# 2   2     1   60      97      60
# 3   3     1   45      86      78
# 4   4     1   30      98      58
# 5   9     3   20      98      15
# 6  10     3   50      98      45
# 7  11     3   65      65      65
# 8  12     3   45      85      32
# 9  17     5   65      68      98
# 10 18     5   80      78      90
# 11 19     5   89      68      87
# 12 20     5   78      83      58



#------------------------------
## 추출한 행으로 데이터 만들기
class1 <- exam %>% filter(class == 1) # cl ass 가 1인 행 추출, cl ass1에 할당
class2 <- exam %>% filter(class == 2) # cl ass 가 2인 행 추출, cl ass2에 할당

mean(class1$math) # 1반 수학 점수 평균 구하기
# [1] 46.25
mean(class2$math) # 2반 수학 점수 평균 구하기
# [1] 61.25