#필요한 변수만 추출하기 - select() - 열(변수) 추출

library(dplyr)
exam <- read.csv("Data/csv_exam.csv")
exam

#    id class math english science
# 1   1     1   50      98      50
# 2   2     1   60      97      60
# 3   3     1   45      86      78
# 4   4     1   30      98      58
# 5   5     2   25      80      65
# 6   6     2   50      89      98
# 7   7     2   80      90      45
# 8   8     2   90      78      25
# 9   9     3   20      98      15
# 10 10     3   50      98      45
# 11 11     3   65      65      65
# 12 12     3   45      85      32
# 13 13     4   46      98      65
# 14 14     4   48      87      12
# 15 15     4   75      56      78
# 16 16     4   58      98      65
# 17 17     5   65      68      98
# 18 18     5   80      78      90
# 19 19     5   89      68      87
# 20 20     5   78      83      58

#------------------------------

exam %>% select(math)  #math 추출

#    math
# 1    50
# 2    60
# 3    45
# 4    30
# 5    25
# 6    50
# 7    80
# 8    90
# 9    20
# 10   50
# 11   65
# 12   45
# 13   46
# 14   48
# 15   75
# 16   58
# 17   65
# 18   80
# 19   89
# 20   78

exam %>% select(english)  #english 추출

#    english
# 1       98
# 2       97
# 3       86
# 4       98
# 5       80
# 6       89
# 7       90
# 8       78
# 9       98
# 10      98
# 11      65
# 12      85
# 13      98
# 14      87
# 15      56
# 16      98
# 17      68
# 18      78
# 19      68
# 20      83



## 여려 변수 추출하기
exam %>% select(class, math, english) # class, math, english 변수 추출
#    class math english
# 1      1   50      98
# 2      1   60      97
# 3      1   45      86
# 4      1   30      98
# 5      2   25      80
# 6      2   50      89
# 7      2   80      90
# 8      2   90      78
# 9      3   20      98
# 10     3   50      98
# 11     3   65      65
# 12     3   45      85
# 13     4   46      98
# 14     4   48      87
# 15     4   75      56
# 16     4   58      98
# 17     5   65      68
# 18     5   80      78
# 19     5   89      68
# 20     5   78      83


## 변수 제외하기
exam %>%  select(-math) #math 제외
exam %>% select(-math, -english) # math, english 제외

#    id class science
# 1   1     1      50
# 2   2     1      60
# 3   3     1      78
# 4   4     1      58
# 5   5     2      65
# 6   6     2      98
# 7   7     2      45
# 8   8     2      25
# 9   9     3      15
# 10 10     3      45
# 11 11     3      65
# 12 12     3      32
# 13 13     4      65
# 14 14     4      12
# 15 15     4      78
# 16 16     4      65
# 17 17     5      98
# 18 18     5      90
# 19 19     5      87
# 20 20     5      58



#------------------------------
## dplyr 함수 조합하기

# class 가 1인 행만 추출한 다음 english 추출
exam %>% filter(class == 1) %>% select(english)
#   english
# 1      98
# 2      97
# 3      86
# 4      98


#가독성 있게 줄 바꾸기
exam %>%
  filter(class == 1) %>% # class 가 1인 행 추출
  select(english) # english 추출

# > exam %>%
#   +   filter(class == 1) %>% # class 가 1인 행 추출    #이어진것처럼 한번에 실행됨
#   +   select(english) # english 추출
#   english
# 1      98
# 2      97
# 3      86
# 4      98


# 일부만 출력하기
exam %>%
  select(id, math) %>% # i d, mat h 추출
  head # 앞부분 6행까지 추출

#   id math
# 1  1   50
# 2  2   60
# 3  3   45
# 4  4   30
# 5  5   25
# 6  6   50


exam %>%
  select(id, math) %>% # i d, mat h 추출
  head(10) # 앞부분 10행까지 추출

#    id math
# 1   1   50
# 2   2   60
# 3   3   45
# 4   4   30
# 5   5   25
# 6   6   50
# 7   7   80
# 8   8   90
# 9   9   20
# 10 10   50
