#---------------
#Exam 데이터 파악하기
#---------------
##데이터 준비
exam <- read.csv("Data/csv_exam.csv")


#---------------
##head() - 데이터 앞부분 확인하기

head(exam) # 앞에서부터6행까지 출력
#   id class math english science
# 1  1     1   50      98      50
# 2  2     1   60      97      60
# 3  3     1   45      86      78
# 4  4     1   30      98      58
# 5  5     2   25      80      65
# 6  6     2   50      89      98

head(exam, 10) # 앞에서부터 10행까지 출력
#   id class math english science
# 1   1     1   50      98      50
# 2   2     1   60      97      60
# 3   3     1   45      86      78
# 4   4     1   30      98      58
# 5   5     2   25      80      65
# 6   6     2   50      89      98
# 7   7     2   80      90      45
# 8   8     2   90      78      25
# 9   9     3   20      98      15
# 10 10     3   50      98      45


#---------------
##tail() - 데이터 뒷부분 확인하기
tail(exam) # 뒤에서부터 6행까지 출력
#    id class math english science
# 15 15     4   75      56      78
# 16 16     4   58      98      65
# 17 17     5   65      68      98
# 18 18     5   80      78      90
# 19 19     5   89      68      87
# 20 20     5   78      83      58

tail(exam, 10) # 뒤에서부터 10행까지 출력
#    id class math english science
# 11 11     3   65      65      65
# 12 12     3   45      85      32
# 13 13     4   46      98      65
# 14 14     4   48      87      12
# 15 15     4   75      56      78
# 16 16     4   58      98      65
# 17 17     5   65      68      98
# 18 18     5   80      78      90
# 19 19     5   89      68      87
# 20 20     5   78      83      58

#---------------
##View() - 뷰어 창에서 데이터 확인하기
View(exam)
###[유의] View()에서 맨 앞의 V는 대문자


#---------------
##dim() - 몇 행 몇 열로 구성되는지 알아보기(dimension)
dim(exam) # 행, 열 출력
# [1] 20  5 #학생 20명, 5개의 변수


#---------------
##str() - 속성 파악하기
str(exam) # 데이터 속성 확인
# 'data.frame':	20 obs. of  5 variables: #20개의 관측치, 5개의 변수
# $ id     : int  1 2 3 4 5 6 7 8 9 10 ...
# $ class  : int  1 1 1 1 2 2 2 2 3 3 ...
# $ math   : int  50 60 45 30 25 50 80 90 20 50 ...
# $ english: int  98 97 86 98 80 89 90 78 98 98 ...
# $ science: int  50 60 78 58 65 98 45 25 15 45 ...


#---------------
##summary() - 요약통계량 산출하기
summary(exam) # 요약통계량 출력

#Qu.: quantile: 하위 25% 위치하는 값
#Mean: 평균
#Median: 중앙값
#3rd Qu. (하위)75% 해당하는값

#      id            class        math          english        science     
# Min.   : 1.00   Min.   :1   Min.   :20.00   Min.   :56.0   Min.   :12.00  
# 1st Qu.: 5.75   1st Qu.:2   1st Qu.:45.75   1st Qu.:78.0   1st Qu.:45.00  
# Median :10.50   Median :3   Median :54.00   Median :86.5   Median :62.50  
# Mean   :10.50   Mean   :3   Mean   :57.45   Mean   :84.9   Mean   :59.45  
# 3rd Qu.:15.25   3rd Qu.:4   3rd Qu.:75.75   3rd Qu.:98.0   3rd Qu.:78.00  
# Max.   :20.00   Max.   :5   Max.   :90.00   Max.   :98.0   Max.   :98.00 